In [2]:
import pandas as pd
from pandas import DataFrame
df1 = DataFrame([
                 ["Aryan","Singh","Full Time","administration",2,20000],
                 ["Rohan","Agarwal","Intern","Technical",3,5000],
                 ["Riya","Shah","Full Time","administration",5,10000],
                 ["Yash","Bhatia","Part Time","Technical",7,10000],
                 ["Siddant","Khanna","Full Time","Management",6,20000]
    
                 
               ],columns = ["First Name","Last Name","Type","Department","yoE","Salary"])
df1

  First Name Last Name       Type      Department  yoE  Salary
0      Aryan     Singh  Full Time  administration    2   20000
1      Rohan   Agarwal     Intern       Technical    3    5000
2       Riya      Shah  Full Time  administration    5   10000
3       Yash    Bhatia  Part Time       Technical    7   10000
4    Siddant    Khanna  Full Time      Management    6   20000

1. Make a pivot table which shows average salary of each type of employee for each department.

In [6]:
import pandas as pd
table = pd.pivot_table(df1,index = "Type",columns="Department",values="Salary")
table

Department  Management  Technical  administration
Type
Full Time      20000.0        NaN         15000.0
Intern             NaN     5000.0             NaN
Part Time          NaN    10000.0             NaN

# Make a pivot table which shows the sum and mean of the salaries of each type of employee and the number of employees of each type.

In [12]:
t= pd.pivot_table(df1,index="Type",values="Salary",aggfunc=["mean","sum","count"])
t

                   mean    sum  count
                 Salary Salary Salary
Type
Full Time  16666.666667  50000      3
Intern      5000.000000   5000      1
Part Time  10000.000000  10000      1